; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v4 - type_1 ?v7 - type_3)
 	      (pred_1 ?v1 - object ?v7 - type_3)
	      (pred_2 ?v4 - type_1 ?v3 - type_2)
	      (pred_4 ?v4 - type_1 ?v1 - object ?v3 - type_2))

   (:action op_1
       :parameters  (?v4 - type_1 ?v6 ?v8 - type_3)
       :precondition (and  (pred_3 ?v4 ?v6))
       :effect (and  (pred_3 ?v4 ?v8)
		     (not (pred_3 ?v4 ?v6))))

   (:action op_2
       :parameters (?v4 - type_1 ?v2 - object ?v5 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_1 ?v2 ?v5) (pred_3 ?v4 ?v5) (pred_2 ?v4 ?v3))
       :effect (and (pred_4 ?v4 ?v2 ?v3)
		    (not (pred_1 ?v2 ?v5)) 
		    (not (pred_2 ?v4 ?v3))))

   (:action op_3
       :parameters (?v4 - type_1 ?v2 - object ?v5 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_4 ?v4 ?v2 ?v3) (pred_3 ?v4 ?v5))
       :effect (and (pred_1 ?v2 ?v5)
		    (pred_2 ?v4 ?v3)
		    (not (pred_4 ?v4 ?v2 ?v3)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_07 - type_1
obj_08 obj_05 - type_2
obj_01 obj_06 obj_10 obj_09 - type_3
obj_04 obj_03 obj_02 - object)
(:init
(pred_3 obj_07 obj_06)
(pred_2 obj_07 obj_08)
(pred_2 obj_07 obj_05)
(pred_1 obj_04 obj_09)
(pred_1 obj_03 obj_10)
(pred_1 obj_02 obj_06)
)
(:goal
(and
(pred_1 obj_04 obj_10)
(pred_1 obj_03 obj_10)
(pred_1 obj_02 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_07 ?b obj_05))))
)
)

; plan
1. (op_2 obj_07 obj_02 obj_06 obj_08)
   deleted: (pred_1 obj_02 obj_06) (pred_2 obj_07 obj_08)
   added: (pred_4 obj_07 obj_02 obj_08)
   goals met: 1 of 3
2. (op_1 obj_07 obj_06 obj_09)
   deleted: (pred_3 obj_07 obj_06)
   added: (pred_3 obj_07 obj_09)
   goals met: 1 of 3
3. (op_3 obj_07 obj_02 obj_09 obj_08)
   deleted: (pred_4 obj_07 obj_02 obj_08)
   added: (pred_1 obj_02 obj_09) (pred_2 obj_07 obj_08)
   goals met: 2 of 3
4. (op_2 obj_07 obj_04 obj_09 obj_08)
   deleted: (pred_1 obj_04 obj_09) (pred_2 obj_07 obj_08)
   added: (pred_4 obj_07 obj_04 obj_08)
   goals met: 2 of 3
5. (op_1 obj_07 obj_09 obj_10)
   deleted: (pred_3 obj_07 obj_09)
   added: (pred_3 obj_07 obj_10)
   goals met: 2 of 3
6. (op_3 obj_07 obj_04 obj_10 obj_08)
   deleted: (pred_4 obj_07 obj_04 obj_08)
   added: (pred_1 obj_04 obj_10) (pred_2 obj_07 obj_08)
   goals met: 3 of 3
